import React, { useState } from "react";
import "../styles/style.css";
import "../styles/services.css";
import "../styles/about.css";
import "../styles/demo.css";
import "../styles/responsive.css";
import image9 from "../assets/img/9.png"
import ArabicNavbar from "../components/Arabic-Navbar";
import ArabicFooter from "../components/Arabic-Footer";

const FaqAr = () => {
    const [activeIndex, setActiveIndex] = useState(null);
  
    const toggleFAQ = (index) => {
      setActiveIndex(activeIndex === index ? null : index);
    };
  
    const faqs = [
      {
        question: "هل تتوفر خدمة المواصلات؟",
        answer: `نعم، خدمة المواصلات متوفرة للأطفال الملتحقين بالبرنامج النهاري المتكامل من الساعة الثامنة صباحًا إلى الساعة الواحدة ظهرًا. تقدم هذه الخدمة من قبل شركة متخصصة تهتم بجدولة المواعيد بشكل مباشر، ويمكن للفريق الإداري في المركز أن يزودكم بمعلومات التواصل مع الشركة.`,
      },
      {
        question: "هل تعتبر خدمات التقييم والجلسات العلاجية الفردية مشمولة بالتأمين الصحي؟",
        answer: `يمكن لمركزنا تزويدكم بالمعلومات اللازمة لتقديم طلبات الاسترداد، أما فيما يخص شمولية التأمين فهذا يعتمد على نوع التأمين الخاص بكم وخطته؛ لذا ننصحكم بأخذ مشورة جهة التأمين التي تتعاملون معها.`,
      },
      {
        question: "هل يمكنكم مساعدتي في تحديد الخدمة المناسبة لاحتياجات طفلي؟",
        answer: `من الطبيعي أن يشعر الأهل بالحيرة في البداية إزاء اختيار خطة التأهيل التي تناسب حاجات الطفل، وفي مثل هذه الحال يمكنكم حجز استشارة مجانية، وسيكون أحد مستشاري البرامج معكم؛ ليساعدكم في تحديد المناسب لتطوره. سيكون من المفيد إحضار التقارير السابقة للطفل إن وجدت.`,
      },
      {
        question: "هل برامج التأهيل متوفرة في فترة ما بعد الظهر؟",
        answer: `نعم، يفتح مركز الفرح أبوابه من الساعة الثامنة صباحًا إلى السادسة مساءً، من يوم الأحد إلى الجمعة. يمكننا تصميم برنامج التدخل في الوقت الذي يناسب احتياج الطفل.`,
      },
      {
        question: "فيما يخص الجلسات الفردية، كم عدد الجلسات التي يحتاجها طفلي حتى يبدو عليه التطور الملحوظ؟",
        answer: `هنالك مجموعة من العوامل تؤثر في تطور الطفل؛ كطبيعة التحدي الذي يواجهه، وتفاعله خلال الجلسات، وتعاون الأهل ومقدمي الرعاية، فضلًا عن التكرار الأسبوعي للجلسات. يقوم معالجونا بتقييم تطور الطفل دوريًّا ويشاركون النتائج مع الأهل. إذا توفرت جميع عوامل نجاح التدخل العلاجي يظهر التطور الملحوظ خلال ثلاثة إلى ستة أشهر، وبناءً على النتائج المحققة يتم تحديد حاجة الطفل إلى المزيد من الجلسات سواء للحفاظ على مكاسب العلاج أو لاكتساب مهارات جديدة.`,
      },
      {
        question: "هل يعد البرنامج النهاري المتكامل معادلًا للصفوف المدرسية؟",
        answer: `لا، فبرنامجنا يرتكز إلى تطوير المهارات النمائية، ولا يعد معادلًا لنظام الدراسة الأكاديمية.`,
      },
      {
        question: "هل تقتصر الخدمات المقدمة في المركز على أصحاب الهمم والاحتياجات الخاصة؟",
        answer: `لا، قد يواجه الأطفال من ذوي التطور الطبيعي بعض الصعوبات في تطور اللغة، التعلم، أو الصعوبات النفسية والسلوكية. يمكن لهؤلاء الأطفال الاستفادة من خدمات التقييم والجلسات الفردية.`,
      },
      {
        question: "توفر الشركة التي أعمل بها مخصصات للتعليم، فهل يمكنني استخدام ذلك لتغطية تكاليف تسجيل طفلي في البرنامج النهاري المتكامل؟",
        answer: `نعم، يمكنكم ذلك في حال موافقة الشركة التي تعملون بها. من جهتنا، نحن مستعدون لتجهيز ما يلزم من المستندات في حال طلبها، وتقديمها لشركتكم.`,
      },
      {
        question: "ماذا عن أنشطة الإجازات، هل يمكن تسجيل طفلي خلال الإجازة؟",
        answer: `بالتأكيد، مركزنا مستعد لاستقبال الأطفال على مدار العام. تؤخذ موافقات الجهات المعنية على إقامة مخيمات لإجازات الصيف، الشتاء، والربيع. يمكنكم متابعة "أخبارنا" للاطلاع على أنشطة الإجازة القادمة أو التواصل معنا. تركز المخيمات على تطوير المهارات بأسلوب تفاعلي وممتع، كما تتيح الفرصة لتحسين المهارات الاجتماعية.`,
      },
    ];
    
    return (
      <>
      <ArabicNavbar />
      
         <section className="responsive-section responsive-section-top">
                      <div className="text-content text-right text-direction">
                        <h2 className="responsive-header">أسئلة وأجوبة</h2>
                        <p className="responsive-paragraph text-right text-direction">
                        الأسئلة المتكررة التي تردنا من الأهل مع أجوبتها
نشاركها معكم لتوفير المعلومات التي قد تكونون بحاجة
إليها. لا تترددوا في التواصل معنا في حال طلب المزيد
من التفاصيل.
                        </p>
                      </div>
                      <div className="image-content">
                        <img src={image9} alt="Sample" className="responsive-image" style={{"width":"50%"}}/>
                      </div>
                    </section>
  
        {/* FAQ Section */}
        <section className="faq-section">
          <div className="faq-container">
            {faqs.map((faq, index) => (
              <div key={index} className={`faq-item ${activeIndex === index ? "active" : ""}`}>
                <div className="faq-question" onClick={() => toggleFAQ(index)}>
                  <h3>{faq.question}</h3>
                  <span className="toggle-icon">{activeIndex === index ? "-" : "+"}</span>
                </div>
                {activeIndex === index && (
                  <div className="faq-answer text-right text-direction">
                    <p>{faq.answer}</p>
                  </div>
                )}
              </div>
            ))}
          </div>
        </section>
        <ArabicFooter />
      </>
    );
  };
  
  export default FaqAr ;